Old_blog/aboutme.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="localhost:8000/rss.xml"
      title="RSS feed for localhost:8000/">
<title>[[file:index.html][PLOCK]]</title>
<meta name="author" content="Jorge Beanvides">
<meta name="referrer" content="no-referrer">
<link href= "./static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="./static/favicon.ico">
<link rel="apple-touch-icon-precomposed" href="./static/favicon-152.png">
<link rel="msapplication-TitleImage" href="./static/favicon-144.png">
<link rel="msapplication-TitleColor" href="#0141ff">
<link rel="stylesheet" href="./static/katex.min.css">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://rhyloo.github.io">Un ingeniero en problemas</a>
  <div class="sitelinks">
    <a href="https://github.com/rhyloo">Github</a> | <a href="https://rhyloo.github.io/projects.html">Projects</a> | <a href="https://rhyloo.github.io/about.html">About me</a>
  </div>
</div></div>
<div id="content">
<div class="post-date">09 dic. 2023</div><h1 class="post-title"><a href="localhost:8000/Old_blog/aboutme.html">[[file:index.html][PLOCK]]</a></h1>
<p>
#+insertar descripcion personal
#+Insertar descripcion del proyecto PLOCK
</p>
<div id="outline-container-org0359291" class="outline-2">
<h2 id="org0359291">Sobre mí</h2>
<div class="outline-text-2" id="text-org0359291">
</div>
<div id="outline-container-org8663e34" class="outline-3">
<h3 id="org8663e34">Mi curriculum</h3>
<div class="outline-text-3" id="text-org8663e34">
<p>
<b>Mi Currículum Vitae</b><br>
 <i>actualizado a <span class="timestamp-wrapper"><span class="timestamp">[2019-08-29 ju. 11:35]</span></span></i><br>
 <b>Nombre:</b> Jorge Benavides Macías<br>
 <b>Nacido en:</b> Madrid, España<br>
 <b>Vivo en:</b> Málaga, España<br>
 <b>Nickname:</b> Rhyloo <i>aunque en algunos sitios me conocen como
 Rhyloot porque al parecer no soy el único Rhyloo del planeta</i><br>
 <b>Repositorio:</b> <a href="http:github.com/rhyloo/">Rhyloo</a><br>
 <b>email:</b> <a href="mailto:rhyloot@gmail.com">rhyloot@gmail.com</a><br>
 <i>Nota: este curriculum no es tan serio busca comentar un poco las dudas que podrían surgir durante el camino.</i><br>
</p>

<p>
Curriculum serio #1: <a href="https://www.linkedin.com/in/jorge-benavides-macias/">Linkedin</a><br>
Curriculum serio #2: <del>Insertar curriculum actualziado en latex(en español)</del><br>
Curriculum serio #3: <del>Insertar curriculum europepass(in english)</del><br>
</p>

<p>
Estoy en la universidad, estudio ingeniería de la <del>no lo sé la</del>
</p>

<p>
<del>verdad porque me han concedido el traslado de expediente a</del>
<del>robótica, lo cual implica matricularme en otro grado, etc&#x2026; asi
que diré que estudio</del> energía <del>,que era en lo que estaba
matriculado antes</del><br>
</p>
</div>
<div id="outline-container-org4f917b7" class="outline-4">
<h4 id="org4f917b7"><span class="underline">Mis objetivos en la vida</span></h4>
<div class="outline-text-4" id="text-org4f917b7">
<p>
Estoy en una edad complicada en la que lo que más cuesta es
escribirlo (o por lo menos a mí me pasa)
</p>
<ul class="org-ul">
<li>Lograr que el conocimiento sea accesible para todo el mundo.</li>
<li>Desarrollar ideas que ayuden a cambiar el mundo, energía,
transporte, seguridad.</li>
<li>Aprender y actulizar constamente mis conocimientos en todas las
áreas que pueda.</li>
</ul>
</div>
</div>
<div id="outline-container-org5b51308" class="outline-4">
<h4 id="org5b51308"><span class="underline">Estudios oficiales</span></h4>
<div class="outline-text-4" id="text-org5b51308">
<ul class="org-ul">
<li>ESO. "Unidad Educativa LEMAS" (Ecuador)</li>
<li>Bachillerato "Unidad educativa LEMAS" (Ecuador)</li>
<li>Grado en ingeniería de la energía <i>en curso</i> <code>Universidad de
      Málaga</code> (España)</li>
</ul>
</div>
</div>
<div id="outline-container-org28ff185" class="outline-4">
<h4 id="org28ff185"><span class="underline">Conocimientos</span></h4>
<div class="outline-text-4" id="text-org28ff185">
<p>
<i>Uso una escala del 1 al 10 porque las escalas cualitativas se quedan cortas</i>
</p>
</div>
<ul class="org-ul">
<li><a id="orgaa24b34"></a><a href="https://www.latex-project.org/get/">LaTeX</a><br>
<div class="outline-text-5" id="text-orgaa24b34">
<p>
Empecé con 16 años, mi profesor de matématicas ,del bachillerto,
pertenece a la <a href="https://omec-mat.org/">Olimpiada Matemática ECuatoriana</a>, supongo que fue
allí dónde conoció este sistema de composición de textos en alta
calidad(<a href="https://www.latex-project.org/get/">LaTeX</a>), empezó a usarlo en sus clases para enviar
ejercicios, exámenes, plantillas, una pasada total, al principio
lo vi y dije va un software más de edición, pero luego de una
semana tuve curiosidad y empecé a revisarlo, me descargué los
recursos necesarios (<i>insertar posible guía para tener latex,
beamer, etc</i>) para windows, he hice mi primer documento con algo
más que un <code>Hello world!</code>, era la solución de un ejercicio de
sumatorias, estuve todo el día escribiendo "código" (o eso le
decía a mi madre con emoción),desde que llegué a casa hasta las 2
AM, no tenía la agilidad en los dedos para escribir tantos
<code>\sum{},\dfrac, \sqrt, etc...</code> además había muchas
cosas que no me funcionaban o que no tenía idea de como
modificarlas, fue una larga jornada pero al final funcionó y
quedó un trabjo medianamete decente.
<i>insertar pdf del trabajo</i>
Hoy en día sigo usando <a href="https://www.latex-project.org/get/">LaTeX</a>, trato de introducirlo lo mejor
posible a mi día a día, aunque en la universidad,a excepción de
trabajos importantes como informes de laboratorio (de los cuales
me siento muy orgulloso y sólo tengo dos), lo veo complicado ya
que el tiempo que inviertes en pasar apuntes a <a href="https://www.latex-project.org/get/">LaTeX</a> lo puedes
invertir en otras actividades; no obstante no daré pie, ahora que
tengo Org-mode espero poder hacerlo.
</p>

<p>
<b>Nivel:</b> 5
</p>
</div>
</li>

<li><a id="org4f211f8"></a><a href="https://www.gnu.org/software/emacs/">EMACS</a><br>
<div class="outline-text-5" id="text-org4f211f8">
<div class="pepe" id="orgfc5dae8">
<p>
La historia con <a href="https://www.gnu.org/software/emacs/">EMACS</a> es bastante curiosa ya que podría decir que
fue el mismo Richard Stallaman quién me enseñó el software, a los
17 años empecé a buscar información de GNU/Linux yo ya conocía el
sistema pero no le había dado su debida atención, podría decirse
que había salido de los muros en los que tenía mi comodidad de
internauta (tenía internet en mi ordenador, sabía descargar
cosas, un poco de lenguaje de marcado y algún que otro lenguaje
de programación, empecé por mi fuente favortia de información &#x2013;&gt;
<a href="http://es.wikipedia.org">Wikipedia</a>, leí sobre Linux, vi vídeos sobre Linux, busqué foros y
blogs que hablarán de él, en fin recopilé un montón de
información y al final me volví parte del movimiento quería linux
en mi ordenador, no era una época fácil (o es lo que yo pensaba
porque la verdad no hubiera tenido ningún problema si hubiera
hecho el cambio de S.O. todos los programas que usaba tenían una
versión libre) para hacer el cambio así que planeé algo a futuro,
en ese intento de plan llegué Richard Stallman, leí un montón
sobre él, quién era, el movimiento que fundó, sus ideales,
vídeos, charlas, conferencias, etc&#x2026; un par de horas bien
invertidas la verdad, en fin terminé en la página de <a href="https://www.gnu.org/">GNU/Linux</a> y
otra vez a revisar todo el sitio, llegué a la categoría de
software y oh sorpresa ahí estaba lo que buscaba con tanta
desesperación pero no lo sabía <a href="https://www.gnu.org/software/emacs/">EMACS</a> como si me llamara hice clic
en el enlace y empecé a leer sobre  <a href="https://www.gnu.org/software/emacs/">EMACS</a> naturalmente mi
instinto me obligaba a instalarlo pero no tenía un sitio dónde
hacerlo, tuve que aguardar un par de meses para culminar mi
cometido y cuando por fin lo hice no me decepcionó desde el
primer momento quedé impresionado con todo lo que ofrecía.
</p>

<p>
<b>Nivel:</b> 3
</p>

</div>

<div class="org-src-container">
<pre class="src src-LaTeX"><span style="color: #569cd6;">\documentclass</span>[<span style="color: #9cdcfe;">a4paper</span>]{<span style="color: #dcdcaa;">article</span>}
<span style="color: #569cd6;">\begin</span>{<span style="color: #dcdcaa;">document</span>}
Hello Wolrd!
<span style="color: #569cd6;">\end</span>{<span style="color: #dcdcaa;">document</span>}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #569cd6;">defun</span> <span style="color: #dcdcaa;">org-xor</span> (a b)
   <span style="color: #ce9178;">"Exclusive or."</span>
   (<span style="color: #569cd6;">if</span> a (not b) b))
</pre>
</div>

<footer>
 Trabajo realizado por <a href="https://twitter.com/Rhyloot">Rhyloo</a>
 </footer>
</div>
</li>
</ul>
</div>
</div>
</div>
<div class="taglist"></div>
<div id="comments"><div id="hyvor-talk-view"></div>
<script type="text/javascript">
    var HYVOR_TALK_WEBSITE = 3390;
    var HYVOR_TALK_CONFIG = {
        url: false,
        id: location.pathname
    };
</script>
<script async type="text/javascript" src="//talk.hyvor.com/web-api/embed"></script></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
